xdu-aero-association/FM33LC0XX_Example_0.04/LCD 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_lpuart.h
/**
  * @brief    
  * @rmtoll   ISR    OERR    LL_LPUART_IsActiveFlag_OERR
  * @param    LPUARTx LPUART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_OERR(LPUART_Type *LPUARTx)
{
    return (uint32_t)(READ_BIT(LPUARTx->ISR, LPUART_ISR_OERR_Msk) == (LPUART_ISR_OERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    OERR    LL_LPUART_ClearFlag_OERR
  * @param    LPUARTx LPUART instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_OERR(LPUART_Type *LPUARTx)
{
    WRITE_REG(LPUARTx->ISR, LPUART_ISR_OERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    RXBF    LL_LPUART_IsActiveFlag_RXBF
  * @param    LPUARTx LPUART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_RXBF(LPUART_Type *LPUARTx)
{
    return (uint32_t)(READ_BIT(LPUARTx->ISR, LPUART_ISR_RXBF_Msk) == (LPUART_ISR_RXBF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    RXBF    LL_LPUART_ClearFlag_RXBF
  * @param    LPUARTx LPUART instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_RXBF(LPUART_Type *LPUARTx)
{
    WRITE_REG(LPUARTx->ISR, LPUART_ISR_RXBF_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    TXBE    LL_LPUART_IsActiveFlag_TXBE
  * @param    LPUARTx LPUART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_TXBE(LPUART_Type *LPUARTx)
{
    return (uint32_t)(READ_BIT(LPUARTx->ISR, LPUART_ISR_TXBE_Msk) == (LPUART_ISR_TXBE_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    TXBE    LL_LPUART_ClearFlag_TXBE
  * @param    LPUARTx LPUART instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_TXBE(LPUART_Type *LPUARTx)
{
    WRITE_REG(LPUARTx->ISR, LPUART_ISR_TXBE_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    TXSE    LL_LPUART_IsActiveFlag_TXSE
  * @param    LPUARTx LPUART instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_TXSE(LPUART_Type *LPUARTx)
{
    return (uint32_t)(READ_BIT(LPUARTx->ISR, LPUART_ISR_TXSE_Msk) == (LPUART_ISR_TXSE_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    TXSE    LL_LPUART_ClearFlag_TXSE
  * @param    LPUARTx LPUART instance
  * @retval   None
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_TXSE(LPUART_Type *LPUARTx)
{
    WRITE_REG(LPUARTx->ISR, LPUART_ISR_TXSE_Msk);
}

/**
  * @brief    
  * @rmtoll   BMR    BAUD    LL_LPUART_SetBaudRate
  * @param    LPUARTx LPUART instance
  * @param    BaudRate This parameter can be one of the following values:
  *           @arg @ref LL_LPUART_BAUDRATE_9600
  *           @arg @ref LL_LPUART_BAUDRATE_4800
  *           @arg @ref LL_LPUART_BAUDRATE_2400
  *           @arg @ref LL_LPUART_BAUDRATE_1200
  *           @arg @ref LL_LPUART_BAUDRATE_600
  *           @arg @ref LL_LPUART_BAUDRATE_300
  * @retval   None
  */
__STATIC_INLINE void LL_LPUART_SetBaudRate(LPUART_Type *LPUARTx, uint32_t BaudRate)
{
    MODIFY_REG(LPUARTx->BMR, LPUART_BMR_BAUD_Msk, BaudRate);
}

/**
  * @brief    
  * @rmtoll   BMR    BAUD    LL_LPUART_GetBaudRate
  * @param    LPUARTx LPUART instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LPUART_BAUDRATE_9600
  *           @arg @ref LL_LPUART_BAUDRATE_4800
  *           @arg @ref LL_LPUART_BAUDRATE_2400
  *           @arg @ref LL_LPUART_BAUDRATE_1200
  *           @arg @ref LL_LPUART_BAUDRATE_600
  *           @arg @ref LL_LPUART_BAUDRATE_300
  */
__STATIC_INLINE uint32_t LL_LPUART_GetBaudRate(LPUART_Type *LPUARTx)
{
    return (uint32_t)(READ_BIT(LPUARTx->BMR, LPUART_BMR_BAUD_Msk));
}

/**
  * @brief    
  * @rmtoll   RXBUF        LL_LPUART_ReceiveData
  * @param    LPUARTx LPUART instance
  * @retval   The LPUart received data
  */
__STATIC_INLINE uint32_t LL_LPUART_ReceiveData(LPUART_Type *LPUARTx)
{
    return (uint32_t)(READ_BIT(LPUARTx->RXBUF, 0x1ffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   TXBUF        LL_LPUART_TransmitData
  * @param    LPUARTx LPUART instance
  * @param    Data The data need to transmit through the LPUart
  * @retval   None
  */
__STATIC_INLINE void LL_LPUART_TransmitData(LPUART_Type *LPUARTx, uint32_t Data)
{
    MODIFY_REG(LPUARTx->TXBUF, (0x1ffU << 0U), (Data << 0U));
}

/**
  * @brief    
  * @rmtoll   DMR        LL_LPUART_SetMatchedData
  * @param    LPUARTx LPUART instance
  * @param    Data The value of match under SLEEP MODE
  * @retval   None
  */
__STATIC_INLINE void LL_LPUART_SetMatchedData(LPUART_Type *LPUARTx, uint8_t Data)
{
    MODIFY_REG(LPUARTx->DMR, (0xffU << 0U), (Data << 0U));
}

/**
  * @brief    
  * @rmtoll   DMR        LL_LPUART_GetMatchedData
  * @param    LPUARTx LPUART instance
  * @retval   The value of match data under SLEEP MODE
  */
__STATIC_INLINE uint32_t LL_LPUART_GetMatchedData(LPUART_Type *LPUARTx)
{
    return (uint32_t)(READ_BIT(LPUARTx->DMR, 0xffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   BMR    MCTL    LL_LPUART_SetMCTLVel
  * @param    LPUARTx LPUART instance
  * @param    Data The value of Bit Modulation Control
  * @retval   None
  */
__STATIC_INLINE void LL_LPUART_SetMCTLVel(LPUART_Type *LPUARTx, uint32_t Data)
{
    MODIFY_REG(LPUARTx->BMR, (0xfffU << 16U), (Data << 16U));
}

/**
  * @brief    
  * @rmtoll   BMR    MCTL    LL_LPUART_GetMCTLVel
  * @param    LPUARTx LPUART instance
  * @retval   The value of Bit Modulation Control
  */
__STATIC_INLINE uint16_t LL_LPUART_GetMCTLVel(LPUART_Type *LPUARTx)
{
    return (uint32_t)(READ_BIT(LPUARTx->BMR, 0xfffU) >> 16U);
}

/**
  * @}
  */

/** @defgroup LPUART_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_LPUART_DeInit(LPUART_Type *LPUARTx);
void LL_LPUART_StructInit(LL_LPUART_InitTypeDef *LPUART_InitStruct);
ErrorStatus LL_LPUART_Init(LPUART_Type *LPUARTx, LL_LPUART_InitTypeDef *LPUART_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_LPUART_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-09-16**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
